Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: for loops are the most complex loops in PHP.
pt_br: Loops for são os laços mais complexos em PHP.

source: They behave like their C counterparts.
pt_br: Eles se comportam como os seus compatíveis em C.

source: The syntax of a for loop is:
pt_br: A sintaxe de um loop for é:

source: for (expr1; expr2; expr3) statement
pt_br: for (expr1; expr2; expr3) instrucoes

source: The first expression (expr1) is evaluated (executed) once unconditionally at the beginning of the loop.
pt_br: A primeira expressão (expr1) é avaliada (executada) uma vez incondicionalmente no começo do loop.

source: In the beginning of each iteration, expr2 is evaluated.
pt_br: No começo de cada iteração, expr2 é avaliada.

source: If it evaluates to TRUE, the loop continues and the nested statement( s) are executed.
pt_br: Se ela é avaliada como TRUE, o loop continua e o( s) comando(s) aninhado(s) é(são) executado(s).

source: If it evaluates to FALSE, the execution of the loop ends.
pt_br: Se é avaliada como FALSE, a execução do 'loop' termina.

source: At the end of each iteration, expr3 is evaluated (executed).
pt_br: No fim de cada iteração, expr3 é avaliada (executada).

source: Each of the expressions can be empty. expr2 being empty means the loop should be run indefinitely (PHP implicitly considers it as TRUE, like C).
pt_br: Cada uma das expressões pode ser vazia. expr2 vazia significa que o loop pode rodar indefinidamente (PHP considera-a implicitamente como TRUE, como em C).

source: This may not be as useless as you might think, since often you 'd want to end the loop using a conditional break statement instead of using the for truth expression.
pt_br: Isto pode não ser tão inútil quanto você pode pensar, pois freqüentemente você pode querer terminar o 'loop' usando uma instrução break condicional em vez de usar a expressão-verdade do for.

source: Consider the following examples.
pt_br: Considere os seguintes exemplos.

source: All of them display numbers from 1 to 10:
pt_br: Todos eles mostram números de 1 a 10:

source: /* example 1 * / for ($i = 1; $i = 10; $i++) {print $i;} / * example 2 * / for ($i = 1;;$i++) {if ($i 10) {break;} print $i;} / * example 3 * / $i = 1; for (;;) {if ($i 10) {break;} print $i; $i++;} / * example 4 * / for ($i = 1; $i = 10; print $i, $i++);
pt_br: /* exemplo 1 * / for ($i = 1; $i = 10; $i++) {print $i;} / * exemplo 2 * / for ($i = 1;;$i++) {if ($i 10) {break;} print $i;} / * exemplo 3 * / $i = 1; for (;;) {if ($i 10) {break;} print $i; $i++;} / * exemplo 4 * / for ($i = 1; $i = 10; print $i, $i++);

source: Of course, the first example appears to be the nicest one (or perhaps the fourth), but you may find that being able to use empty expressions in for loops comes in handy in many occasions.
pt_br: Obviamente, o primeiro exemplo parece ser o mais bonito (ou talvez o quarto), mas você pode perceber que a possível utilização de expressões vazias em laços for se torna prático em algumas ocasiões.

source: PHP also supports the alternate "colon syntax" for for loops.
pt_br: O PHP também suporta a "sintaxe de dois-pontos" alternativa para laços for:

source: for (expr1; expr2; expr3): statement;...; endfor;
pt_br: for (expr1; expr2; expr3): instrucoes;...; endfor;

source: Other languages have a foreach Other languages have a foreach statement to traverse an array or hash.
pt_br: Outras linguagens têm uma instrução foreach para varrer uma matriz ou tabela de hashing.

source: PHP 3 has no such construct; PHP 4 does (see foreach).
pt_br: O PHP 3 não tem uma construção deste tipo; O PHP 4 possui (veja foreach).

source: In PHP 3, you can combine while with the list() and each() functions to achieve the same effect.
pt_br: No PHP 3, você pode combinar while com as funções list() e each() para obter o mesmo efeito.

source: See the documentation for these functions for an example.
pt_br: Veja a documentação para estas funções para exemplos.

source: Any PHP script is built out of a series of statements.
pt_br: Estruturas de Controle

source: A statement can be an assignment, a function call, a loop, a conditional statement of even a statement that does nothing (an empty statement).
pt_br: Uma instrução pode ser uma atribuição, uma chamada de função, um 'loop', uma instrução condicional, ou mesmo uma instrução que não faz nada(um comando vazio).

source: Statements usually end with a semicolon.
pt_br: Instruções geralmente terminam com um ponto e vírgula.

source: In addition, statements can be grouped into a statement-group by encapsulating a group of statements with curly braces.
pt_br: Além disso, as instruções podem ser agrupados em um grupo de comandos através do encapsulamento de um grupo de comandos com chaves.

source: A statement-group is a statement by itself as well.
pt_br: Um grupo de comandos é uma instrução também.

source: The various statement types are described in this chapter.
pt_br: Os vários tipos de instruções são descritos neste capítulo.

source: The if construct is one of the most important features of many languages, PHP included.
pt_br: A construção if é uma das mais importantes implementações de muitas linguagens, incluindo o PHP.

source: It allows for conditional execution of code fragments.
pt_br: Ela permite a execução condicional de fragmentos de código.

source: PHP features an if structure that is similar to that of C:
pt_br: O PHP implementa uma estrutura if que é similar àquela do C:

source: if (expr) statement
pt_br: if (expressao) instrucoes

source: As described in the section about expressions, expr is evaluated to its Boolean value.
pt_br: Como descrita na seção sobre expressões, expressao é avaliado por seu contexto Booleano.

source: If expr evaluates to TRUE, PHP will execute statement, and if it evaluates to FALSE - it 'll ignore it.
pt_br: Se expressao for avaliado como TRUE, o PHP executará instrucoes, e se for avaliado como FALSE, ele será ignorado.

source: More information about what values evaluate to FALSE can be found in the 'Converting to boolean' section.
pt_br: Maiores informações sobre a avaliação para FALSE podem ser encontradas na seção Convertendo para Booleanos.

source: The following example would display a is bigger than b if $a is bigger than $b:
pt_br: Os exemplos a seguir mostrariam que a é maior que b se $a for maior que $b:

source: if ($a $b) print "a is bigger than b";
pt_br: if ($a $b) print "a é maior que b";

source: Often you 'd want to have more than one statement to be executed conditionally.
pt_br: Freqüentemente você vai querer ter mais que uma instrução seja executado condicionalmente.

source: Of course, there 's no need to wrap each statement with an if clause.
pt_br: E é claro, não há necessidade de englobar cada instrução com uma cláusula if.

source: Instead, you can group several statements into a statement group.
pt_br: Em vez disso, você pode colocar várias instruções em um agrupamento de comandos.

source: For example, this code would display a is bigger than b if $a is bigger than $b, and would then assign the value of $a into $b:
pt_br: Por exemplo, este código mostraria a é maior que b se $a for maior que $b, e então atribuiria o valor de $a para $b:

source: if ($a $b) {print "a is bigger than b"; $b = $a;}
pt_br: if ($a $b) {print "a é maior que b"; $b = $a;}

source: If statements can be nested indefinitely within other if statements, which provides you with complete flexibility for conditional execution of the various parts of your program.
pt_br: Comandos if podem ser aninhados indefinidamente dentro de outros comandos if, o que faz com que você complete a flexibilidade para a execução condicional de várias partes do seu programa.

source: The switch statement is similar to a series of IF statements on the same expression.
pt_br: A instrução switch é similar a uma série de instruções IFs seguidas.

source: In many occasions, you may want to compare the same variable (or expression) with many different values, and execute a different piece of code depending on which value it equals to.
pt_br: Em muitas ocasiões, você poderá ter que comparar a mesma variável (ou expressão) com muitos valores diferentes, executando códigos diferentes dependendo com qual valor ele se encaixar.

source: This is exactly what the switch statement is for.
pt_br: É exatamente para isso que a instrução switch faz.

source: The following two examples are two different ways to write the same thing, one using a series of if statements, and the other using the switch statement:
pt_br: Os exemplos seguintes mostram duas maneiras diferentes de escrever a mesma coisa, uma utilizando uma série de is s e a outra utlizando a instrução switch:

source: if ($i == 0) {print "i equals 0";} if ($i == 1) {print "i equals 1";} if ($i == 2) {print "i equals 2";} switch ($i) {case 0: print "i equals 0"; break; case 1: print "i equals 1"; break; case 2: print "i equals 2"; break;}
pt_br: if ($i == 0) {print "i igual a 0";} if ($i == 1) {print "i igual a 1";} if ($i == 2) {print "i igual a 2";} switch ($i) {case 0: print "i igual a 0"; break; case 1: print "i igual a 1"; break; case 2: print "i igual a 2"; break;}

source: It is important to understand how the switch statement is executed in order to avoid mistakes.
pt_br: É importante entender como a instrução switch funciona para evitar enganos.

source: The switch statement executes line by line (actually, statement by statement).
pt_br: A instrução switch executa linha a linha (atualmente, instrução a instrução).

source: In the beginning, no code is executed.
pt_br: No início, nenhum código é executado.

source: Only when a case statement is found with a value that matches the value of the switch Only when a case statement is found with a value that matches the value of the switch expression does PHP begin to execute the statements.
pt_br: Somente quando uma instrução case é encontrada com um valor que combina com a expressão do switch faz com que o PHP execute as instruções a partir daí.

source: PHP continues to execute the statements until the end of the switch block, or the first time it sees a break statement.
pt_br: O PHP continua executando as instruções até o fim do bloco switch ou na primeira vez que encontrar uma instrução break.

source: If you don' t write a break statement at the end of a case's statement list, PHP will go on executing the statements of the following case.
pt_br: Se você não escrever uma instrução break no fim das instruções case, o PHP continuará executando os case s seguintes.

source: For example:
pt_br: Exemplo:

source: switch ($i) {case 0: print "i equals 0"; case 1: print "i equals 1"; case 2: print "i equals 2";}
pt_br: switch ($i) {case 0: print "i igual a 0"; case 1: print "i igual a 1"; case 2: print "i igual a 2";}

source: Here, if $i is equal to 0, PHP would execute all of the print statements!
pt_br: Aqui, se $i é igual a zero, o PHP executará todas as instruções print!.

source: You would get the expected behavior ('i equals 2 'would be displayed) only if $i is equal to 2.
pt_br: Se $i é igual a 1, o PHP executará os últimas duas instruções print, e somente se $i for igual a 2, você terá o comportamento 'esperado' apenas onde 'i igual a 2 'será mostrado.

source: Thus, it is important not to forget break statements (even though you may want to avoid supplying them on purpose under certain circumstances).
pt_br: Então é importante não se esquecer das instruções break (e as vezes não colocá-las para obter esse resultado em certas circunstâncias).

source: In a switch statement, the condition is evaluated only once and the result is compared to each case statement.
pt_br: Em uma instrução switch, a condição somente será avaliada e resultado comparado para cada instrução case.

source: In an elseif statement, the condition is evaluated again.
pt_br: Em uma instrução elseif, a condição é avaliada novamente.

source: If your condition is more complicated than a simple compare and / or is in a tight loop, a switch may be faster.
pt_br: Se sua condição é mais complicada que um simples comparação e / ou e dentro de um loop, um switch é mais rápido.

source: The statement list for a case can also be empty, which simply passes control into the statement list for the next case.
pt_br: Um case pode não ter nenhuma instrução dentro, o que simplesmente passa o controle para o próximo case.

source: switch ($i) {case 0: case 1: case 2: print "i is less than 3 but not negative"; break; case 3: print "i is 3";}
pt_br: switch ($i) {case 0: case 1: case 2: print "i é menor que 3 mas não negativo"; break; case 3: print "i é 3";}

source: A special case is the default case.
pt_br: Um case especial é o default.

source: This case matches anything that wasn 't matched by the other cases, and should be the last case statement.
pt_br: Ele precisa ser a última instrução case.

source: switch ($i) {case 0: print "i equals 0"; break; case 1: print "i equals 1"; break; case 2: print "i equals 2"; break; default: print "i is not equal to 0, 1 or 2";}
pt_br: switch ($i) {case 0: print "i igual a 0"; break; case 1: print "i igual a 1"; break; case 2: print "i igual a 2"; break; default: print "i não é igual a 0, 1 ou 2";}

source: The case expression may be any expression that evaluates to a simple type, that is, integer or floating-point numbers and strings.
pt_br: A expressão avaliada pelo case A expressão avaliada pelo case precisa ser um tipo simples, ou seja, inteiros, números de ponto flutuante e strings.

source: Arrays or objects cannot be used here unless they are dereferenced to a simple type.
pt_br: Arrays ou objetos não podem ser utilizados a não ser que eles impliquem num tipo simples.

source: The alternative syntax for control structures is supported with switches.
pt_br: A sintaxe alternativa para estruturas de controle é suportada para os switches.

source: For more information, see Alternative syntax for control structures.
pt_br: Para maiores informações, veja Sintaxe alternativa para estruturas de controle.

source: switch ($i): case 0: print "i equals 0"; break; case 1: print "i equals 1"; break; case 2: print "i equals 2"; break; default: print "i is not equal to 0, 1 or 2"; endswitch;
pt_br: switch ($i): case 0: print "i igual a 0"; break; case 1: print "i igual a 1"; break; case 2: print "i igual a 2"; break; default: print "i não é igual a 0, 1 ou 2"; endswitch;

source: while loops are the simplest type of loop in PHP.
pt_br: Loops while são o tipo mais simples de criar um 'loop' em PHP.

source: They behave just like their C counterparts.
pt_br: Eles se comportam como seus compatíveis em C.

source: The basic form of a while statement is:
pt_br: O formato básico de um comando while é:

source: while (expr) statement
pt_br: while (expressao) instrucoes

source: The meaning of a while The meaning of a while statement is simple.
pt_br: O significado de um comando while é simples.

source: It tells PHP to execute the nested statement( s) repeatedly, as long as the while expression evaluates to TRUE.
pt_br: Ele pede que o PHP execute os comandos aninhados repetidamente, enquanto a expressão do while é avaliada como TRUE.

source: The value of the expression is checked each time at the beginning of the loop, so even if this value changes during the execution of the nested statement( s), execution will not stop until the end of the iteration (each time PHP runs the statements in the loop is one iteration).
pt_br: O valor da expressão é verificada cada vez que se passa no começo do 'loop', desta forma, mesmo que este valor mude durante a execução do(s) comando(s) aninhado(s), a execução não parará até que o fim da iteração (cada vez que o PHP executa os comandos dentro do 'loop' é uma iteração).

source: Sometimes, if the while expression evaluates to FALSE from the very beginning, the nested statement( s) won't even be run once.
pt_br: Às vezes, se a expressão while é avaliada como FALSE logo no início, o( s) comando(s) aninhado(s) não será(ão) rodado(s) nem uma vez sequer.

source: Like with the if statement, you can group multiple statements within the same while loop by surrounding a group of statements with curly braces, or by using the alternate syntax:
pt_br: Como no comando if, você pode agrupar múltiplos comandos dentro do mesmo laço while englobando um grupo de instruções com chaves, ou usando a sintaxe alternativa:

source: while (expr): statement... endwhile;
pt_br: while (expressao): instrucoes... endwhile;

source: The following examples are identical, and both print numbers from 1 to 10:
pt_br: Os exemplos a seguir são idênticos, e ambos imprimem números de 1 to 10:

source: /* example 1 * / $i = 1; while ($i = 10) {print $i++; / * the printed value would be $i before the increment (post-increment) * /} / * example 2 * / $i = 1; while ($i = 10): print $i; $i++; endwhile;
pt_br: /* exemplo 1 * / $i = 1; while ($i = 10) {print $i++; / * o valor impresso será $i depois do acréscimo (post-increment) * /} / * exemplo 2 * / $i = 1; while ($i = 10): print $i; $i++; endwhile;

source: This manual is © Copyright 1997 - 2003 by the PHP Documentation Group.
pt_br: Este manual tem © Copyright 1997 - 2003 para o PHP Documentation Group.

source: The members of this group are listed on the front page of this manual.
pt_br: Os membros deste grupo são listados na primeira página deste manual.

source: This manual can be redistributed under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.
pt_br: Este manual pode ser redistribuído sob os termos da Licença Pública Geral (GNU) conforme publicada pela Free Software Foundation; a versão 2 da Licença ou (a seu critério) qualquer versão posterior.

source: The 'Extending PHP 4.0' section of this manual is copyright © 2000 by Zend Technologies, Ltd.
pt_br: A seção 'Extendendo PHP 4.0' deste manual tem copyright © 2000 para Zend Technologies, Ltd.

source: This material may be distributed only subject to the terms and conditions set forth in the Open Publication License, v1.0 or later (the latest version is presently available at http: / /www.opencontent.org / openpub /).
pt_br: Este material pode ser distribuido somente sob os termos e condições descritas na Open Publication License v1.0 ou posterior (a versão mais recente está disponível em http: / /www.opencontent.org / openpub /).

source: PHP 3 includes support for a network-based debugger.
pt_br: O debugador do PHP

source: PHP 4 does not have an internal debugging facility.
pt_br: O PHP 3 tem suporte ao debug baseado em rede.

source: You can use one of the external debuggers though.
pt_br: O PHP 4 não possui um utilitário de debug interno.

source: The Zend IDE includes a debugger, and there are also some free debugger extensions like DBG at http: / /dd.cron.ru / dbg /, the Advanced PHP Debugger (APD) or Xdebug which even has a compatible debugger interface as PHP 3's debugging functionality as is described in this section.
pt_br: O Zend IDE inclui um debugador e há também outras extensões grátis como o DBG em http: / /dd.cron.ru / dbg / ou o Advanced PHP Debugger (APD).

source: Using the Debugger
pt_br: Utilizando o debugador

source: Appendix D.
pt_br: Apêndice D.

source: Debugging PHP
pt_br: Próxima

source: The PHP 3 debugger protocol is line-based.
pt_br: O protocolo do debugador do PHP 3 é baseado em linhas.

source: Each line has a type, and several lines compose a message.
pt_br: Cada linha tem um tipo, e várias linhas compõem uma mensagem.

source: Each message starts with a line of the type start and terminates with a line of the type end.
pt_br: Cada mensagem começa com uma linha do tipo start e termina com uma linha do tipo end.

source: PHP 3 may send lines for different messages simultaneously.
pt_br: O PHP 3 pode enviar linhas de diferentes mensagens simultaneamente.

source: A line has this format:
pt_br: Uma linha tem este formato:

source: Date in ISO 8601 format (yyyy - mm - dd)
pt_br: Data no formato ISO 8601 (yyyy - mm - dd)

source: Time including microseconds: hh: mm: uuuuuu
pt_br: Hora, incluindo microsegundos: hh: mm: uuuuuu

source: DNS name or IP address of the host where the script error was generated.
pt_br: Nome DNS ou IP da maquina onde o erro do script foi gerado.

source: PID (process id) on host of the process with the PHP 3 script that generated this error.
pt_br: ID do processo na máquina do processo com o PHP 3 que gerou este erro de script.

source: Type of line.
pt_br: Tipo da linha.

source: Tells the receiving program about what it should treat the following data as:
pt_br: Informa o programa sobre como ele deve tratar os seguintes dados:

source: Table D-1.
pt_br: Tabela D-1.

source: Debugger Line Types
pt_br: Tipos de Linhas de Debug

source: Tells the receiving program that a debugger message starts here.
pt_br: Informa ao programa que a mensagem começa aqui.

source: The contents of data will be the type of error message, listed below.
pt_br: O conteúdo de data será o tipo de erro da mensagem, como listado abaixo.

source: The PHP 3 error message.
pt_br: A mensagem de erro do PHP 3.

source: File name and line number where the error occurred.
pt_br: Arquivo e número da linha onde ocorreu o erro.

source: The first location line will always contain the top-level location. data will contain file: line.
pt_br: A primeira linha location sempre conterá o nível superior. data conterá: arquivo: linha.

source: There will always be a location line after message and after every function.
pt_br: Sempre existirá uma linha location após uma message e após cada function.

source: Number of frames in the following stack dump.
pt_br: Número de janelas (frames) na saida atual.

source: If there are four frames, expect information about four levels of called functions.
pt_br: Se houver quatro níveis, será esperado informação sobre quatro níveis de funções chamadas.

source: If no "frames" line is given, the depth should be assumed to be 0 (the error occurred at top-level).
pt_br: Se não for dada nenhuma linha de janela (frame) assume que o valor é 0 (o erro aconteceu no início).

source: Name of function where the error occurred.
pt_br: Nome da função onde o erro ocorreu.

source: Will be repeated once for every level in the function call stack.
pt_br: Será repetida para cada vez que a função for chamada dentro da pilha.

source: Tells the receiving program that a debugger message ends here.
pt_br: Informa ao programa que a mensagem de debug termina aqui.

source: Line data.
pt_br: Linha de dados.

source: Table D-2.
pt_br: Tabela D-2.

source: Debugger Error Types
pt_br: Tipos de erros de debug

source: Debugger
pt_br: Debugador

source: PHP 3 Internal
pt_br: Interno do PHP 3

source: warning
pt_br: warning (alerta, atenção)

source: error
pt_br: error (erro)

source: parse
pt_br: parse (interpretação)

source: notice
pt_br: notice (notificação)

source: core-error
pt_br: core-error (erro grave)

source: core-warning
pt_br: core-warning (aviso grave)

source: unknown
pt_br: unknown (desconhecido)

source: (any other)
pt_br: (qualquer outro)

source: Example D-1.
pt_br: Exemplo D-1.

source: Example Debugger Message
pt_br: Exemplo de uma mensagem de Debug

source: The internal debugger in PHP 3 is useful for tracking down evasive bugs.
pt_br: O debugador interno do PHP 3 é útil para rastrear bugs fugitivos.

source: The debugger works by connecting to a TCP port for every time PHP 3 starts up.
pt_br: O debugador trabalha conectado em uma porta TCP cada vez que o PHP 3 inicia.

source: All error messages from that request will be sent to this TCP connection.
pt_br: Todas as mensagens de erro daquela requisição será enviada para esta conexão TCP.
